<?php

?>

<div class="well">
<h2>Пользовательское соглашение</h2>
<p>Создавая аккаунт в мобильном приложении или на сайте «ФармБонус», Вы полностью принимаете следующее Пользовательское соглашение.</p>
<h3>1. Стороны соглашения</h3>
<p>Данное Пользовательское соглашение регулирует отношения, которые возникают между
    Администрацией приложения «ФармБонус» (ООО «ФармБонус», далее по тексту Администрация)
    и его Пользователями (владельцами персональных страниц и анкет, респондентами),
    касательно использования приложения «ФармБонус».
    Неотъемлемой частью настоящего соглашения является Политика конфиденциальности (Глава 8).</p>
<h3>2. Предмет соглашения</h3>
<p>Администрация предоставляет Пользователю право использовать бесплатную версию приложения «ФармБонус» в порядке и на условиях, указанных в данном Соглашении. Настоящее Пользовательское соглашение вступает в силу с момента заведения Пользователем аккаунта в приложении «ФармБонус». </p>
    <p>При создании аккаунта (учетной записи) Пользователь полностью принимает условия настоящего Соглашения, а также дает свое согласие на получение информационных рассылок, в том числе и e-мэил рассылок через службы почтовых рассылок на адрес электронной почты Пользователя, содержащих информацию о работе приложения, а также прочей информации.</p>
<h3>3. Права и обязанности Пользователя</h3>
<h4>3.1. Пользователь имеет право:</h4>
    <ul>
        <li>
            <p>создавать собственные Персональные Страницы;</p>
        </li>
        <li>
            <p>в любое время Самостоятельно отписаться от получаемых от Администрации приложения рассылок путем перехода по специальной ссылке в письме или в разделе "Параметры получения писем".</p>
        </li>
        <li>
            <p>получать материальное вознаграждение (далее по тексту – Бонусы) за свою активность в приложении «ФармБонус». Бонусы начисляются за действия, совершенные в отношении анкет, презентаций и прочие действия, в количестве, указанном в данных разделах.</p>
        </li>
    </ul>
<h4>3.2. Пользователь обязуется:</h4>
    <ul>
        <li>
            <p>выполнять условия Соглашения;</p>
        </li>
        <li>
            <p>следовать рекомендациям, указанным в Главе 8.</p>
        </li>
        <li>
            <p>незамедлительно уведомить Администрацию в случае несанкционированного использования собственного аккаунта. До момента получения Администрацией приложения «ФармБонус» данной информации, ответственность за все действия, производимые с данным аккаунтом, несет Пользователь;</p>
        </li>
        <li>
            <p>при регистрации (создании учетной записи) Пользователь обязуется представить актуальную и полную информацию о себе, которая запрашивается регистрационной формой приложения;</p>
        </li>
        <li>
            <p>предоставить достоверную информацию, которая будет располагаться в профиле Пользователя.</p>
        </li>
    </ul>
<h3>4. Права и обязанности Администрации</h3>
<h4>4.1. Администрация имеет право:</h4>
    <ul>
        <li>
            <p>проверять достоверность указанной при регистрации информации.</p>
        </li>
        <li>
            <p>отказать в регистрации Пользователя без объяснения причин.</p>
        </li>
        <li>
            <p>Администрация не производит проверки информации, которая предоставляется Пользователями для всеобщего использования, и не несет ответственности за ее достоверность и / или нарушение прав третьих лиц.</p>
        </li>
    </ul>
<h4>4.2. Администрация обязана:</h4>
    <ul>
        <li>
            <p>сохранять конфиденциальность личных данных Пользователя (кроме случаев оговоренных в настоящем Соглашении).</p>
        </li>
    </ul>
<h3>5. Исключительные права</h3>
<p>Все используемые и размещенные на площадке приложения «ФармБонус»
    объекты (программное обеспечение, контент, графические содержание, дизайн),
    а также само приложение «ФармБонус» являются интеллектуальной собственностью
    их законных правообладателей и охраняются законодательством об интеллектуальной собственности
    Республики Беларусь, а также соответствующими международными правовыми конвенциями.
    Любое использование размещенных площадке приложения «ФармБонус»
    результатов интеллектуальной деятельности
    (в том числе элементов визуального оформления приложения, символики, текстов, графических изображений,
    иллюстраций, фото, видео, и других объектов) без разрешения Администрации или законного правообладателя
    является незаконным и может послужить причиной привлечения к ответственности в соответствии с действующим
    законодательством.</p>
<h3>6. Ограничение ответственности Администрации</h3>
<p>Приложение «ФармБонус» постоянно дорабатывается, в этой связи Администрация не гарантирует его бесперебойного функционирования. Администрация сохраняет за собой право в любое время изменять оформление приложения.
Администрация, ни при каких условиях не несет ответственности за последствия использования Пользователем приложения «ФармБонус». На Пользователя возлагается вся ответственность за возможные последствия использования материалов, в том числе за ущерб, который такое использование может причинить программному обеспечению Пользователя или третьим лицам, за потерю данных или любой другой вред, который может быть причинен.
Администрация не несет ответственности перед Пользователем или перед любыми третьими лицами за любой косвенный, случайный, неумышленный ущерб, включая упущенную выгоду или потерянные данные, вред чести, достоинству или деловой репутации, вызванный в связи с использованием приложения «ФармБонус», информации размещенной на площадке приложения или иных материалов, к которым Пользователь или иные лица получили доступ с помощью приложения, даже если Администрация предупреждала или указывала на возможность такого вреда.</p>
Администрация не несет никакой ответственности за переходы Пользователя по внешним ссылкам на другие сайты, размещенные в сети Интернет, которые могут нанести вред программному обеспечению Пользователя, за доступность и содержание этих сайтов, а также любые последствия, связанные с их использованием.
<h3>7. Сроки и условия действия соглашения</h3>
<p>Настоящее Пользовательское соглашение между Администрацией приложения «ФармБонус» и Пользователем вступает в силу с момента создания Пользователем аккаунта в приложении и действует до момента его удаления.
При создании аккаунта Пользователь принимает условия Пользовательского соглашения и рекомендации Главы 8.
Пользователь соглашается с тем, что Администрация вправе изменить условия настоящего Соглашения в одностороннем порядке, без какого-либо специального уведомления Пользователя.
Настоящее Соглашение является открытым и общедоступным документом. Пользователь обязуется самостоятельно знакомиться со всеми изменениями не реже одного раза в два-три календарных дня.</p>

<h3>8. Политика конфиденциальности</h3>

<p>Администрация при регистрации каждого нового Пользователя собирает и хранит информацию о нем: пол, имя пользователя, адрес электронной почты, номер телефона (необязательно), город работы, данные об образовании, фирма работодатель, номер и адрес аптеки. Эти данные дают Вам возможность пользоваться возможностями приложения «ФармБонус», а также получать Бонусы (материальное вознаграждение). Персональные данные могут передаваться третьим лицам, если данные собираются и/или хранятся любой другой организацией кроме ООО «ФармБонус», Вас уведомят об этом до момента получения информации. Вся информация о Пользователях полностью защищена.
Администрация обязуется хранить конфиденциальность предоставляемой Пользователями информации.</p>
<h4>8.1. Другое</h4>
<p>Администрация имеет право предоставить информацию о Пользователе третьим лицам в случае возбуждения правовых действий в отношении авторов или респондентов, нарушающих Пользовательское соглашение, причиняющих вред приложению «ФармБонус» или другим пользователям или в отношении любых других лиц, несущих ущерб в результате такой деятельности.
Информация о Вашем профиле (личных данных) в приложении «ФармБонус» защищены паролем, только Вы имеете доступ к этой информации. Мы рекомендуем никому не передавать свой пароль.
Администрация прилагает все усилия, чтобы защитить Вашу информацию. Приложение «ФармБонус» не может полностью гарантировать безопасность передачи информации от Пользователя напрямую или через онлайн-сервисы. После получения Вашей информации Администрация прилагает максимальные усилия для обеспечения ее конфиденциальности и максимальной защиты в нашей системе хранения.
Вы можете просматривать и редактировать Ваши персональные данные в личном Профиле в любое время, используя Ваш логин и пароль для входа приложение «ФармБонус». Вы также можете удалить или заблокировать свой аккаунт. Для удаления или блокировки Вашего аккаунта, просим связаться с нами по адресу info@pharmbonus.by.
Все вопросы, связанные с Пользовательским соглашением, направляйте по адресу info@pharmbonus.by.</p>
</div>
