<div class="well">
    <h2>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ</h2>

    <p class=rvps3><span class=rvts7>Настоящее пользовательское соглашение (далее - Соглашение) представляет собой предложение Общества с ограниченной ответственностью «ФармБонус» (далее </span><span
            class=rvts8>&#8211;</span><span class=rvts7> Лицензиар) заключить лицензионный договор о предоставлении простой неисключительной лицензии на использование Приложения и/или Сайта ФармБонус для целей работы с Информационной базой данных ФармБонус на условиях изложенных ниже:</span>
    </p>

    <h3>1. Общие положения</h3>

    <p class=rvps3><span class=rvts7>1.1. В настоящем документе и вытекающих или связанных с ним отношениях Сторон применяются следующие термины и определения:</span>
    </p>

    <p class=rvps3><span class=rvts9>1.1.1. </span><span class=rvts6>Соглашение</span><span class=rvts7> </span><span
            class=rvts8>&#8211;</span><span class=rvts7> настоящий документ со всеми дополнениями, изменениями и указанными в нем обязательствами, а также лицензионный договор, заключенный на его основании;</span>
    </p>

    <p class=rvps4><span class=rvts9>1.1.2.</span><span class=rvts6> Информационная база данных ФармБонус (далее Информационная база) </span><span
            class=rvts10>&#8211;</span><span class=rvts6> </span><span class=rvts11>представленная в </span><a
            class=rvts12 href="https://ru.wikipedia.org/wiki/??????_(%25?????????">объективной</a><span
            class=rvts13> </span><span class=rvts11>форме </span><a class=rvts12
                                                                    href="https://ru.wikipedia.org/wiki/?????????">совокупность</a><span
            class=rvts13> </span><span class=rvts11>самостоятельных материалов, </span><a class=rvts12
                                                                                          href="https://ru.wikipedia.org/wiki/??????????????">систематизированных</a><span
            class=rvts13> </span><span class=rvts11>таким образом, чтобы эти материалы могли быть </span><a class=rvts12
                                                                                                            href="https://ru.wikipedia.org/wiki/?????_??????">найдены</a><span
            class=rvts13> </span><span class=rvts11>и обработаны с помощью </span><a class=rvts12
                                                                                     href="https://ru.wikipedia.org/wiki/?????????">электронной
            вычислительной машины (ЭВМ)</a><span class=rvts9>;</span></p>

    <p class=rvps4><span class=rvts9>1.1.3. </span><span class=rvts6>Сайт ФармБонус (далее Сайт)</span><span
            class=rvts7> - совокупность логически связанный между собой веб-страниц, размещенных под единым доменным именем PharmBonus во всемирной сети Интернет и объединенных единой тематикой, доступ к которому возможен по сетевому адресу </span><a
            class=rvts14 href="http://www.pharmbonus.by">www.PharmBonus.by</a><span class=rvts9>;</span></p>

    <p class=rvps3><span class=rvts9>1.1.4. </span><span class=rvts6>Пользователь</span><span class=rvts7> </span><span
            class=rvts8>&#8211;</span><span class=rvts7> лицензиат, который является дееспособным физическим лицом, имеющим фармацевтическое и/или медицинское образование, являющийся действующим провизором/фармацевтом, и/или врачом/ медицинским работником, прошедший установленную Лицензиаром процедуру регистрации на сайте ФармБонус либо в мобильном приложении ФармБонус;</span>
    </p>

    <p class=rvps3><span class=rvts9>1.1.5. </span><span
            class=rvts6>Политика конфиденциальности персональных данных</span><span class=rvts9> </span><span
            class=rvts6>(далее </span><span class=rvts10>&#8211;</span><span
            class=rvts6> Политика конфиденциальности)</span><span class=rvts7> обязательный к принятию Пользователем документ, являющийся неотъемлемой частью Соглашения и определяющий порядок предоставления, сбора, обработки и использования персональных (личных) данных Пользователя;</span>
    </p>

    <p class=rvps4><span class=rvts9>1.1.6.&nbsp;</span><span class=rvts6> Приложение</span><span
            class=rvts9> </span><span class=rvts6>ФармБонус (далее Приложение)</span><span
            class=rvts9>&nbsp; </span><span class=rvts15>&#8211;</span><span class=rvts9> </span><a class=rvts12
                                                                                                    href="https://ru.wikipedia.org/wiki/???????????_???????????">программное
            обеспечение</a><span class=rvts11>, предназначенное для работы на </span><a class=rvts12
                                                                                        href="https://ru.wikipedia.org/wiki/????????">смартфонах</a><span
            class=rvts13>, </span><a class=rvts12
                                     href="https://ru.wikipedia.org/wiki/??????????_?????????">планшетах</a><span
            class=rvts13> </span><span class=rvts11>и других мобильных устройствах, размещенное и&nbsp; доступное для скачивания и установки в онлайн магазинах приложений </span><a
            class=rvts16 href="http://store">App Store</a><span class=rvts13>, </span><span class=rvts11>Google play market, и иных;</span>
    </p>

    <p class=rvps3><span class=rvts9>1.1.7. </span><span class=rvts6>Устройство</span><span class=rvts7> </span><span
            class=rvts8>&#8211;</span><span class=rvts7> персональный компьютер, планшет, мобильный телефон, коммуникатор, смартфон, иное устройство, позволяющее использовать Приложение и/или Сервис по их функциональному назначению;</span>
    </p>

    <p class=rvps3><span class=rvts9>1.1.8. </span><span class=rvts6>Сервис </span><span class=rvts8>&#8211;</span><span
            class=rvts7> совокупность функциональных возможностей по работе с Информационной базой, предоставляемых Пользователю посредством использования соответствующих разделов Приложения и (или) Сайта;</span>
    </p>

    <p class=rvps3><span class=rvts9>1.1.9. </span><span class=rvts6>Контент </span><span
            class=rvts8>&#8211;</span><span class=rvts7> изображения, текстовые, аудио- и видеоматериалы, а также прочие объекты авторских и (или) смежных прав, а равно не являющиеся таковыми информация и сообщения медицинской и иной тематики, размещенные в Информационной базе третьими лицами (фармацевтическими компаниями, фармацевтическими производителями и прочими лицами) на основании соответствующих договоров&nbsp; с Лицензиаром, а также непосредственно самим Лицензиаром и не являющиеся рекламой;</span>
    </p>

    <p class=rvps3><span class=rvts9>1.1.10. </span><span class=rvts6>Авторизация пользователя</span><span
            class=rvts7> </span><span class=rvts8>&#8211;</span><span class=rvts7> единая система регистрации и авторизации в Приложении и/или на Сайте с использованием идентификатора, присваиваемого Пользователю Администрацией (в соответствии с процедурой регистрации);</span>
    </p>

    <p class=rvps3><span class=rvts9>1.1.11. </span><span class=rvts6>Профиль и/или (Личный кабинет)</span><span
            class=rvts7> </span><span class=rvts8>&#8211;</span><span class=rvts7> персональный раздел Приложения и Сайта, к которому Пользователь получает доступ после прохождения регистрации в Приложении и/или на Сайте и авторизации со стороны Лицензиара. Профиль и/или (Личный кабинет) предназначен для хранения персональных данных Пользователя.</span>
    </p>

    <p class=rvps3><span class=rvts7>1.2. Использование Пользователем Приложения и/или Сайта любым способом и в любой форме в пределах их объявленных функциональных возможностей (Сервисов), включая:</span>
    </p>
    <ul class=list0>
        <li style="margin-left: 0px" class=rvps6><span class=rvts7>регистрацию и/или авторизацию в Приложении и/или на Сайте;</span>
        </li>
        <li style="margin-left: 0px" class=rvps8><span
                class=rvts7>просмотр Контента посредством Приложения и/или Сайте;</span></li>
        <li style="margin-left: 0px" class=rvps8><span class=rvts7>размещение или отображение в Приложении и/или на Сайте любой информации;</span>
        </li>
        <li style="margin-left: 0px" class=rvps10><span class=rvts7>иное использование функциональных возможностей Приложения и/или Сайта </span>
        </li>
    </ul>
    <p class=rvps8><span class=rvts8>&#8211;</span><span class=rvts7> создает лицензионный договор по использованию Приложения и/или Сайта, предназначенных для работы с Информационной базой на условиях настоящего Соглашения и дополнительных документов к нему в соответствии с положениями ст.ст. 398, 407 и 408 Гражданского кодекса Республики Беларусь.</span>
    </p>

    <p class=rvps3><span class=rvts7>1.3. Настоящим Соглашением и указанными в нем обязательными документами определяются основные условия использования Приложения и/или Сайта, а также любое развитие и/или добавление новых функциональных возможностей Приложения и/или Сайта.</span>
    </p>

    <p class=rvps3><span class=rvts7>1.4. Обязательным условием использования Приложения и/или Сайта является полное и безоговорочное принятие Лицензиатом условий, установленных в:</span>
    </p>

    <p class=rvps3><span class=rvts7>1.4.1. Настоящем Соглашении, размещенном в сети Интернет по адресу: </span><a
            class=rvts16 href="https://vk.com/away.php?utf=1&amp;to=http://pharmbonus.by/terms">http://pharmbonus.by/terms</a><span
            class=rvts7> и/или доступном к ознакомлению в разделе «Профиль»&nbsp; Приложения.</span></p>

    <p class=rvps3><span class=rvts9>1</span><span class=rvts7>.4.2. Политике конфиденциальности, размещенной в сети Интернет по адресу: </span><a
            class=rvts16 href="https://vk.com/away.php?utf=1&amp;to=http://pharmbonus.by/terms">http://pharmbonus.by/terms</a><span
            class=rvts7> и/или доступной к ознакомлению в разделе «Профиль» Приложения.&nbsp; </span></p>

    <p class=rvps3><span class=rvts9>1.4</span><span class=rvts7>.3. Заполняя регистрационную форму на Сайте и/или в Приложении, Пользователь подтверждает, что ознакомился в полном объеме с настоящим Соглашением и Политикой конфиденциальности и принимает вышеуказанные документы полностью без каких-либо исключений либо ограничений. В противном случае, Пользователь не имеет права передавать Лицензиару свои регистрационные данные для обработки, авторизации и последующей её (его) регистрации в Приложения и/или на Сайте. </span>
    </p>

    <p class=rvps3><span class=rvts7>1.5. Предоставление права на использование функциональных возможностей Приложения и/или Сайта регулируется настоящим Соглашением, а также дополнительными документами к нему.</span>
    </p>

    <p class=rvps3><span class=rvts7>1.6. Настоящее Соглашение, включая относящиеся к нему документы, может быть изменено Лицензиаром в одностороннем порядке без какого-либо специального уведомления Пользователя. Новая редакция Соглашения и/или указанных в нем документов вступает в силу с момента размещения на Сайте (</span><a
            class=rvts16 href="https://vk.com/away.php?utf=1&amp;to=http://pharmbonus.by/terms">http://pharmbonus.by/terms</a><span
            class=rvts7>) и в разделе </span><span class=rvts17>«</span><span class=rvts7>Профиль»</span><span
            class=rvts17> </span><span class=rvts7>Приложения.</span></p>

    <h3>2. Общие условия пользования Приложением и/или Сайтом.</h3>

    <p class=rvps3><span class=rvts7>2.1. Просмотр Контента, размещенного в разделах Приложения и/или на Сайте, требует обязательной регистрации и/или авторизации Пользователя.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.2. Любое применение функциональных возможностей Приложения и/или Сайта, включая использование Сервисов, допускается только после прохождения Пользователем регистрации и авторизации в Приложении и/или Сайте в соответствии с правилами, установленными Лицензиаром.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.3. Любое действие Пользователя по использованию Приложения и/или Сайта означает, что Пользователь добросовестно ознакомился с документами, регулирующими порядок использования Приложения и/или Сайта, а также изменениями и дополнениями в вышеуказанные документы (в случае наличия таковых) и выражает свое конклюдентное согласие на принятие условий, содержащихся в вышеперечисленных документах. </span>
    </p>

    <p class=rvps3><span class=rvts7>2.4. После прохождения Пользователем процедуры регистрации и авторизации Лицензиаром создается уникальная учетная запись, связанная с Профилем и/или (Личным кабинетом) Пользователя в Приложении и/или на Сайте, которая необходима для использования функциональных возможностей Приложения и/или Сайта.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.5. Для регистрации Пользователь обязуется предоставить достоверную и полную информацию о себе ответив на вопросы, предлагаемые в регистрационной форме, и поддерживать эту информацию в актуальном состоянии на протяжении всего периода использования Приложения и/или Сайта, а также соответствующих Сервисов.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.6. В случае предоставления Пользователем неверной информации, а также в случае наличия у Лицензиара оснований полагать, что предоставленная Пользователем информация является неполной и/или недостоверной, Лицензиар имеет право по своему усмотрению заблокировать либо удалить Учетную запись Пользователя, а также отказать Пользователю в использовании Приложения и/или Сайта и связанных с ними Сервисов полностью или в определенной части.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.7. Лицензиар оставляет за собой право в любой момент потребовать от Пользователя подтверждения данных, указанных при регистрации, также запросить в связи с этим подтверждающие документы (диплом о высшем медицинском или фарм. образовании)</span><span
            class=rvts18>, </span><span class=rvts7>а также обратиться по месту работы Пользователя, указанному при регистрации, для уточнения персональных данных Пользователя.</span><span
            class=rvts18> </span><span class=rvts7>Не предоставление вышеуказанных сведений может быть приравнено Лицензиаром к предоставлению недостоверной информации и повлечь последствия, предусмотренные п. 2.6 Соглашения. В случае если данные Пользователя, указанные в предоставленных им документах, не соответствуют данным, указанным при регистрации, а также в случае, когда данные, указанные при регистрации, не позволяют идентифицировать пользователя, Администрация вправе применить меры, указанные в п.2.6. Соглашения.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.8. Информация о Пользователе, содержащаяся в учетной записи в Профиле и/или (Личном кабинете) Пользователя, хранится и обрабатывается Лицензиаром в соответствии Политикой конфиденциальности.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.9. При регистрации Пользователь самостоятельно выбирает себе логин (уникальное символьное имя учетной записи Пользователя) и пароль для доступа к Профилю и/или (Личному кабинету). Последующее изменение пароля осуществляется Пользователем через Профиль и/или (Личный кабинет)</span><span
            class=rvts17> </span><span class=rvts7>Приложения и/или Сайта. </span></p>

    <p class=rvps3><span class=rvts7>2.10. Лицензиар вправе устанавливать требования к минимальному количеству символов, содержащихся в логине и/или пароле Пользователя, а также устанавливать ограничения по использованию тех либо иных символов в логине и/или пароле, а также самостоятельно применять ту либо иную методику для определения безопасности выбираемого Пользователем логина и/или пароля.</span>
    </p>

    <p class=rvps3><span class=rvts7>2.11. Зарегистрированный Пользователь самостоятельно определяет порядок использования Профиля и/или (Личного кабинета) Приложения и/или Сайта, а также иных функциональных возможностей Приложения и/или Сайта, включая использование соответствующих Сервисов. Вместе с тем, действия Пользователя по использованию Приложения и/или Сайта ни при каких условиях не может противоречить настоящему Соглашению, а также действующему законодательству Республики Беларусь. </span>
    </p>

    <p class=rvps3><span class=rvts7>2.12. Порядок и последствия использования логина и пароля Пользователем определяются в разделе 6 настоящего Соглашения.</span>
    </p>

    <h3>3. Ограничения ответственности Лицензиара. Ответственность Пользователя.</h3>

    <p class=rvps3><span
            class=rvts7>3.1.Принимая условия настоящего Соглашения, Пользователь понимает и признает, что:</span></p>

    <p class=rvps3><span class=rvts7>3.1.1.&nbsp; Лицензиар вправе устанавливать лимиты и ограничения в использовании Приложения и/или Сайта для всех Пользователей, либо для отдельных Пользователей.&nbsp; </span>
    </p>

    <p class=rvps3><span class=rvts7>3.1.2. Информация об установлении соответствующих ограничений будут доводиться Лицензиаром до сведения Пользователя в форме и способом, которые определяются по единоличному усмотрению Лицензиара.</span>
    </p>

    <p class=rvps3><span class=rvts7>3.2. Если иное не предусмотрено соответствующими изменениями в настоящем Соглашении либо дополнительных документах к нему:</span>
    </p>

    <p class=rvps3><span class=rvts7>3.2.1. Пользователь использует Приложения и/или Сайт на свой собственный риск. Сервисы предоставляются «как есть» и Лицензиар не принимает на себя никакой ответственности, в том числе за соответствие функциональных возможностей Приложения и/или Сайта, а также предоставляемых на их основе Сервисов целям Пользователя;</span>
    </p>

    <p class=rvps3><span class=rvts7>3.2.2. Пользователь принимает и признает, что Информационная база, Приложение и Сайт не являются инструментами рекламы и информационными площадками для осуществления рекламной деятельности как третьими лицами, так и самим Лицензиаром, и не созданы для стимулирования продаж товаров, а также побуждению Пользователя к приобретению тех или иных товаров. Контент, доступный Пользователю посредством использования функциональных возможностей Приложения и/или Сайта, носит исключительно информационный характер и доступен Пользователю посредством его конклюдентного согласия (т.е. выраженного желания Пользователя на получение доступа к вышеуказанной информации путем принятия условий настоящего Соглашения).</span>
    </p>

    <p class=rvps3><span class=rvts7>3.3. Лицензиар не гарантирует, что: </span></p>

    <p class=rvps3><span class=rvts7>3.3.1. Функциональные возможности Приложения и/или Сайта, а также предоставляемых на их основе Сервисов соответствуют требованиям Пользователя на момент принятия Соглашения и будут соответствовать им впоследствии</span><span
            class=rvts9>;</span></p>

    <p class=rvps3><span
            class=rvts7>3.3.2. Сервисы будут предоставляться непрерывно, быстро, надежно и без ошибок;</span></p>

    <p class=rvps3><span class=rvts7>3.3.3.&nbsp; Информация, которая может быть получена посредством использования Приложения и/или Сайта, а также предоставляемых на их основе Сервисов, будет точной и надежной и может использоваться для каких-либо целей иных чем информационных (например, для установления и/или подтверждения каких-либо фактов, дальнейшего распространения третьим лицам, использования в научных целях и иных); </span>
    </p>

    <p class=rvps3><span class=rvts7>3.3.4. Качество информации и Контента, полученных с использованием Приложения и/или Сайта, а также предоставляемых на их основе Сервисов, будет соответствовать ожиданиям и нуждам Пользователя;</span>
    </p>

    <p class=rvps3><span class=rvts7>3.3.5. Любая информация, доступ к которой Пользователь получает посредством использования Приложения и/или Сайта, может использоваться Пользователем исключительно на свой собственный риск. Пользователь самостоятельно несет ответственность за возможные последствия использования полученной информации, в том числе за ущерб, который это может причинить Пользователю, компьютеру Пользователя или третьим лицам, а также за потерю данных либо любой иной вред (имущественный и неимущественный);</span>
    </p>

    <p class=rvps3><span class=rvts7>3.3.6. Поскольку функциональные возможности Приложения и/или Сайта находятся на стадии постоянного дополнения и обновления, форма и характер функциональных возможностей, а также предоставляемых на их основе Сервисов могут время от времени меняться без предварительного уведомления Пользователя. Лицензиар вправе при необходимости по собственному усмотрению прекратить (временно или окончательно) доступ к каким-либо функциональным возможностям Приложения и/или Сайта (включая предоставляемые на их основе Сервисы) всем Пользователям вообще или отдельному Пользователю в частности, без предварительного уведомления;</span>
    </p>

    <p class=rvps3><span class=rvts7>3.3.7. Лицензиар не несет ответственности за любые виды убытков, произошедшие вследствие использования Пользователем Приложения и/или Сайта, а также информации, полученной при их помощи;</span>
    </p>

    <p class=rvps3><span class=rvts7>3.3.8. При любых обстоятельствах ответственность Лицензиара в соответствии со статьей 14 Гражданского кодекса Республики Беларусь ограничена 10 (десятью) рублями и возлагается на него при наличии в его действиях доказанной вины.</span>
    </p>

    <p class=rvps3><span class=rvts7>3.4. Лицензиар никак не связан с Контентом, размещенным третьими лицами в Информационной базе и не обязан осуществлять проверку содержания, подлинности и безопасности такого Контента либо, равно как и его соответствия требованиям действующего законодательства, а также наличия у третьих лиц необходимого объема прав на его распространение и/или использование. Вместе с тем, Лицензиар в обязательной форме предусматривает положение(я) о соответствии Контента, размещаемого в Информационной базе, требованиям действующего законодательства Республики Беларусь в своих договорах с третьими лицами.&nbsp; </span>
    </p>

    <p class=rvps3><span class=rvts7>3.6. Пользователь соглашается с тем, что Лицензиар не обязан осуществлять предварительную проверку Контента любого вида, размещаемого в Информационной базе и распространяемого третьими лицами посредством Приложения и/или Сайта, а также то, что Лицензиар имеет право, а не обязанность, по своему усмотрению отказать третьим лицам в размещении и распространении ими Контента или удалить любой Контент, который доступен посредством использования Приложения и/или Сайта.</span>
    </p>

    <p class=rvps3><span class=rvts7>3.7. Пользователь осознает и согласен с тем, что он должен самостоятельно оценивать все риски, связанные с получением Контента, включая оценку его надежности, полноты и полезности.</span>
    </p>

    <p class=rvps3><span class=rvts7>3.8. При использовании Приложения и/или Сайта Пользователь не вправе:</span></p>

    <p class=rvps3><span class=rvts7>3.8.1.&nbsp; Загружать в Информационную базу, а также посылать, передавать или любым другим способом распространять среди иных Пользователей информацию, которая является незаконной, вредоносной, клеветнической, оскорбляет нравственность, демонстрирует (или является пропагандой) насилие и жестокость, нарушает права интеллектуальной собственности, пропагандирует ненависть и/или дискриминацию людей по расовому, этническому, половому, религиозному, социальному признакам, содержит оскорбления в адрес каких-либо лиц или организаций, содержит элементы (или является пропагандой) порнографии, детской эротики, представляет собой рекламу (или является пропагандой) услуг сексуального характера (в том числе под видом иных услуг), разъясняет порядок изготовления, применения или иного использования наркотических веществ или их аналогов, взрывчатых веществ или иного оружия, нарушает права третьих лиц, в том числе несовершеннолетних и может причинить им вред в любой форме;</span>
    </p>

    <p class=rvps3><span class=rvts7>3.8.2. Выдавать себя за другого человека или представителя организации и/или сообщества без достаточных на то прав, в том числе за сотрудников Лицензиара либо третьих лиц, размещающих информацию в Информационной базе, а также применять любые другие формы и способы незаконного представительства других лиц в сети Интернет для введения в заблуждение иных Пользователей и/или Лицензиара, и/или третьих лиц</span><span
            class=rvts9>;</span></p>

    <p class=rvps3><span class=rvts7>3.8.3. Несанкционированно собирать и хранить персональные данные других лиц;</span>
    </p>

    <p class=rvps3><span class=rvts7>3.8.4. Любым способом нарушать нормальную работу Приложения и/или Сайта;</span></p>

    <p class=rvps3><span class=rvts7>3.8.5. Содействовать действиям, направленным на нарушение ограничений и запретов, налагаемых настоящим Соглашением и дополнительными документами к нему;</span>
    </p>

    <p class=rvps3><span class=rvts7>3.8.6. Другим образом нарушать нормы законодательства, в том числе нормы международного права, действующие на территории Республики Беларусь посредством использования Сайта и/или Приложения.</span>
    </p>

    <p class=rvps3><span class=rvts7>3.9. В случае обнаружения нарушения прав и/или интересов Лицензиара и/или Пользователей, и/или третьих лиц в связи с использованием Приложения и/или Сайта, Пользователь обязан немедленно сообщить об этом Лицензиару путем направления письменного уведомления с подробным изложением обстоятельств нарушения и гипертекстовой ссылкой в раздел Приложения и/или на страницу Сайта, содержащий материалы, которыми нарушаются соответствующие права и/или интересы.</span>
    </p>

    <p class=rvps3><span class=rvts7>3.10. При наличии претензий в отношении нарушения любых имущественных и/или личных неимущественных прав третьих лиц, а равно установленных законодательством запретов или ограничений определенным Пользователем, такой Пользователь обязан по требованию Лицензиара пройти официальную идентификацию, предоставив Лицензиару нотариально заверенное обязательство урегулировать возникшие претензии собственными силами и за свой счет с указанием своих паспортных данных.</span>
    </p>

    <p class=rvps3><span class=rvts7>3.11. В случае привлечения Лицензиара к ответственности или наложения на него взыскания в связи с допущенными Пользователем нарушениями прав и/или интересов Лицензиара и/или третьих лиц, и/или иных Пользователей, а равно установленных законодательством запретов или ограничений, такой Пользователь обязан в полном объеме возместить убытки Лицензиара (в т.ч. при возникновении у Лицензиара регрессных требований к Пользователю, возникших исходя из смысла ст.950 Гражданского кодекса Республики Беларусь).</span>
    </p>

    <p class=rvps3><span class=rvts7>3.12. При многократном или грубом нарушении Пользователем условий настоящего Соглашения, а также положений дополнительных документов к нему и/или требований законодательства Республики Беларусь, Лицензиар вправе заблокировать или удалить учетную запись Пользователя, а также запретить доступ с использованием учетной записи Пользователя к Приложению и/или Сайту и удалить любые, указанные Пользователем в Профиле и/или (Личном кабинете), сведения без предварительного уведомления.</span>
    </p>

    <h3>4. Интеллектуальные права.</h3>

    <p class=rvps3><span class=rvts7>4.1. Все объекты Информационной базы, Приложения и Сайта, в том числе элементы дизайна, программные коды, текст, графические изображения, иллюстрации, видео, архитектура Информационной базы, сама Информационная база и размещенный в ней Контент, являются объектами исключительных прав Лицензиара и иных правообладателей (в том числе третьих лиц).</span>
    </p>

    <p class=rvps3><span class=rvts7>4.2. Лицензиар предоставляет Пользователю право функционального использования Приложения и/или Сайта в пределах их общих функциональных возможностей.</span>
    </p>

    <p class=rvps3><span class=rvts7>4.3. Использование Приложения и/или Сайта иными способами,&nbsp; в том числе путем копирования (воспроизведения) размещенного в Информационно базе Контента (доступ к которому осуществляется посредством использования Приложения и/или Сайта), а также входящих в состав Приложения и/или Сайта элементов дизайна, программ для ЭВМ и баз данных, их декомпиляция, модификация, и последующее распространение, публичный показ, доведение до всеобщего сведения, строго запрещены, если иное не предусмотрено настоящим Соглашением.</span>
    </p>

    <p class=rvps3><span class=rvts7>4.4. Пользователь не вправе воспроизводить, повторять и копировать, продавать, а также использовать для каких-либо коммерческих целей (в т.ч. рекламных) какие-либо части Приложения и/или Сайта (включая Контент, доступный Пользователю посредством Приложения и/или Сайта, а также предоставляемых на их основе Сервисов), или доступ к ним, кроме тех случаев, когда Пользователь получил такое разрешение от Лицензиара, либо когда это прямо предусмотрено дополнительными документами на использование отдельных функциональных возможностей Приложения и/или Сайта.</span>
    </p>

    <p class=rvps3><span class=rvts7>4.5. Использование Пользователем Приложения и/или Сайта, а также размещенного в них Контента для личного некоммерческого использования допускается при условии сохранения всех знаков охраны авторского права, смежных прав, товарных знаков, фирменных наименований, других уведомлений об авторстве, сохранения имени (или псевдонима) автора/наименования правообладателя в неизменном виде, сохранении соответствующего объекта в неизменном виде. Исключение составляют случаи, прямо предусмотренные законодательством Республики Беларусь, настоящим Соглашением и/или дополнительными документами к нему.</span>
    </p>

    <p class=rvps3><span class=rvts7>4.6. Приложения и/или Сайт могут содержать ссылки на сайты в сети Интернет (сайты третьих лиц). Указанные третьи лица и их контент не проверяются Лицензиаром на соответствие тем или иным требованиям (достоверности, полноты, законности и т.п.). Лицензиар не несет ответственности за любую информацию, материалы, размещенные на сайтах третьих лиц, к которым Пользователь получает доступ в связи с использованием Приложения и/или Сайта, а также за доступность таких сайтов или информации и последствия их использования Пользователем.</span>
    </p>

    <p class=rvps3><span class=rvts7>4.7. Ссылка (в любой форме) на любой сайт, продукт, услугу, любую информацию коммерческого или некоммерческого характера, размещенная в рамках Приложения и/или Сайта, не является одобрением или рекомендацией данных продуктов (услуг, деятельности) со стороны Лицензиара, за исключением случаев, когда на это прямо указывается самим Лицензиаром.</span>
    </p>

    <h3>5. Уведомления.</h3>

    <p class=rvps3><span
            class=rvts7>5.1. Лицензиар вправе посылать Пользователю уведомления (в т.ч. Push-уведомления</span><span
            class=rvts9>) </span><span class=rvts19>на </span><span class=rvts7>указанный в его Профиле и/или (Личном кабинете) электронный адрес, почтовый адрес, рабочий адрес, а также номер мобильного телефона о важных событиях, происходящих в рамках активности Приложения и/или Сайта или в связи с ним, в том числе с использованием почтовых клиентов.</span>
    </p>

    <p class=rvps3><span class=rvts7>5.2. Помимо прочего допускается использование уведомлений (в т.ч. Push-уведомления) для информирования Пользователя об ограничениях доступа к Информационной базе, Приложению и/или Сайту, а также предоставляемых на их основе Сервисах в связи с профилактическими работами, нарушениями Пользователя, изменением функциональных возможностей Приложения и/или Сайта, включая изменение Соглашения и/или Политики конфиденциальности, и/или иных дополнительных документов.</span>
    </p>

    <p class=rvps3><span class=rvts7>5.3. Лицензиар по собственному усмотрению вправе использовать уведомления (в т.ч. Push-уведомления) для распространения иной информации не противоречащей положениям настоящего Соглашения.</span>
    </p>

    <h3>6. Соглашение об использовании электронной подписи.</h3>

    <p class=rvps3><span class=rvts7>6.1. Во взаимоотношениях между Лицензиаром и Пользователем могут использоваться электронные документы, удостоверенные простой электронной подписью.</span>
    </p>

    <p class=rvps3><span class=rvts7>6.2. Простой электронной подписью признается электронная подпись, которая посредством использования логина и пароля Пользователя или указанного в Профиле и/или (Личном кабинете) адреса электронной почты Пользователя (ключ электронной подписи) подтверждает факт формирования электронной подписи непосредственно Пользователем.</span>
    </p>

    <p class=rvps3><span class=rvts7>6.3. По соглашению Сторон электронные документы, подписанные простой электронной подписью, признаются равнозначными документам на бумажных носителях, подписанным собственноручной подписью.</span>
    </p>

    <p class=rvps3><span class=rvts7>6.4. Лицензиар определяет Пользователя, которому соответствует простая электронная подпись, по используемому Пользователем логину и паролю, указанным при регистрации и авторизации в Приложении и/или на Сайте, - в случае совершения любых действий по использованию Приложения и/или Сайта, либо по используемому Пользователем адресу электронной почты </span><span
            class=rvts8>&#8211;</span><span
            class=rvts7> в случае поступления Лицензиару сообщений с такого адреса.</span></p>

    <p class=rvps3><span class=rvts7>6.5. Любые действия, совершенные с использованием простой электронной подписи определенного Пользователя, считаются совершенными таким Пользователем.</span>
    </p>

    <p class=rvps3><span class=rvts7>6.6. Пользователь обязуется соблюдать конфиденциальность ключа электронной подписи. В частности, Пользователь не имеет права передавать свои логин и пароль или предоставлять доступ к своей электронной почте третьим лицам, и несет полную ответственность за их сохранность и индивидуальное использование, самостоятельно выбирая способ их хранения и ограничения доступа к ним.</span>
    </p>

    <p class=rvps3><span class=rvts7>6.7. В случае несанкционированного доступа к логину и паролю, их утраты или раскрытия третьим лицам Пользователь обязан незамедлительно сообщить об этом Лицензиару путем направления электронного письма с указанного в своем Профиле и/или (Личный кабинете) адреса электронной почты.</span>
    </p>

    <p class=rvps3><span class=rvts7>6.8. В случае утраты или несанкционированного доступа к электронной почте, адрес которой указан в Профиле и/или (Личный кабинете), Пользователь обязан незамедлительно заменить такой адрес в Профиле и/или (Личный кабинете) на новый и сообщить о данном факте Лицензиару путем направления электронного письма с нового адреса электронной почты.</span>
    </p>

    <h3>7. Заключительные положения.</h3>

    <p class=rvps3><span class=rvts7>7.1. Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Республики Беларусь. Вопросы, не урегулированные настоящим Соглашением, подлежат разрешению в соответствии с законодательством Республики Беларусь. Все возможные споры, вытекающие из отношений, регулируемых настоящим Соглашением, разрешаются в порядке, установленном действующим законодательством Республики Беларусь.&nbsp; </span>
    </p>

    <p class=rvps3><span class=rvts7>7.2. Если по тем или иным причинам одно или несколько положений настоящего Соглашения будут признаны недействительными или не имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных положений Соглашения.</span>
    </p>

    <p class=rvps3><span class=rvts7>7.3. Бездействие со стороны Лицензиара в случае нарушения Пользователем положений Соглашения и/или дополнительных документов к нему не лишает Лицензиара права предпринять соответствующие действия в защиту своих интересов позднее, а также не означает отказ Лицензиара от своих прав в случае совершения в последующем подобных либо похожих нарушений.</span>
    </p>

    <p class=rvps3><span class=rvts7>7.4. Все споры по Соглашению или в связи с ним подлежат рассмотрению в суде по месту нахождения Лицензиара в соответствии с действующим законодательством Республики Беларусь.</span>
    </p>

    <p class=rvps11><span class=rvts7>Обновлено «08» февраля 2017 года.</span></p>

    <p class=rvps11><span class=rvts20><br></span></p>

    <h2>ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h2>

    <p class=rvps12><span class=rvts7>Настоящая Политика конфиденциальности персональных данных (далее </span><span
            class=rvts8>&#8211;</span><span class=rvts7> Политика конфиденциальности) действует в отношении всей информации, которую Приложение ФармБонус и/или Сайт ФармБонус, могут получить о Пользователе во время их правомерного использования - т.е. использования в соответствии с требованиями Пользовательского соглашения. </span>
    </p>

    <h3>1. Термины и определения.</h3>

    <p class=rvps12><span class=rvts7>1.1.</span><span class=rvts7> &nbsp; &nbsp; &nbsp; &nbsp;</span><span class=rvts7>В настоящей Политике конфиденциальности используются следующие термины: </span>
    </p>

    <p class=rvps14><span class=rvts9>1.1.1. </span><span class=rvts6>Информационная база данных ФармБонус (далее Информационная база) </span><span
            class=rvts15>&#8211;</span><span class=rvts9> </span><span class=rvts11>представленная в </span><a
            class=rvts12 href="https://ru.wikipedia.org/wiki/??????_(%25?????????">объективной</a><span
            class=rvts13> </span><span class=rvts11>форме </span><a class=rvts12
                                                                    href="https://ru.wikipedia.org/wiki/?????????">совокупность</a><span
            class=rvts13> </span><span class=rvts11>самостоятельных материалов, </span><a class=rvts12
                                                                                          href="https://ru.wikipedia.org/wiki/??????????????">систематизированных</a><span
            class=rvts13> </span><span class=rvts11>таким образом, чтобы эти материалы могли быть </span><a class=rvts12
                                                                                                            href="https://ru.wikipedia.org/wiki/?????_??????">найдены</a><span
            class=rvts13> </span><span class=rvts11>и обработаны с помощью </span><a class=rvts12
                                                                                     href="https://ru.wikipedia.org/wiki/?????????">электронной
            вычислительной машины (ЭВМ)</a><span class=rvts21>;</span><span class=rvts9> </span></p>

    <p class=rvps14><span class=rvts9>1.1.2. </span><span class=rvts6>Сайт ФармБонус (далее Сайт)</span><span
            class=rvts7> - совокупность логически связанный между собой веб-страниц, размещенных под единым доменным именем PharmBonus во всемирной сети Интернет и объединенных единой тематикой, доступ к которому возможен по сетевому адресу </span><a
            class=rvts14 href="http://www.pharmbonus.by">www.PharmBonus.by</a><span class=rvts9>;</span></p>

    <p class=rvps15><span class=rvts9>1.1.3. </span><span class=rvts6>Приложение</span><span class=rvts9> </span><span
            class=rvts6>ФармБонус (далее Приложение)</span><span class=rvts9>&nbsp; </span><span
            class=rvts15>&#8211;</span><span class=rvts9> </span><a class=rvts22
                                                                    href="https://ru.wikipedia.org/wiki/???????????_???????????">программное
            обеспечение</a><span class=rvts7>, предназначенное для работы на </span><a class=rvts22
                                                                                       href="https://ru.wikipedia.org/wiki/????????">смартфонах</a><span
            class=rvts23>, </span><a class=rvts22
                                     href="https://ru.wikipedia.org/wiki/??????????_?????????">планшетах</a><span
            class=rvts23> </span><span class=rvts7>и других мобильных устройствах, размещенное и&nbsp; доступное для скачивания и установки в онлайн магазинах приложений </span><a
            class=rvts14 href="http://store">App Store</a><span class=rvts23>, </span><span class=rvts7>Google play market, и иных;</span>
    </p>

    <p class=rvps16><span class=rvts9>1.1.4. </span><span
            class=rvts6>Пользовательское соглашение (далее Соглашении) </span><span class=rvts7>-&nbsp; обязательный к принятию Пользователем документ, определяющий права и устанавливающий обязанности Пользователя в процессе использования Приложения и/или Сайта для целей работы с Информационной базой, а также лицензионное соглашение, заключенное на его основе;</span>
    </p>

    <p class=rvps17><span class=rvts9>1.1.5.&nbsp; </span><span class=rvts6>Пользователь </span><span class=rvts7>- лицо, соответствующее требованиям, определенным в Соглашении и прошедшее установленную Соглашением процедуру регистрации и авторизации;</span>
    </p>

    <p class=rvps16><span class=rvts9>1.1.6.</span><span class=rvts9> &nbsp; &nbsp; &nbsp; &nbsp;</span><span
            class=rvts6>Администрация</span><span class=rvts7> </span><span class=rvts8>&#8211;</span><span class=rvts7> сотрудники, уполномоченные на управление Приложением и/или Сайтом, действующие от имени ООО “ФармБонус”, которые организуют и/или осуществляют обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;</span>
    </p>

    <p class=rvps12><span class=rvts9>1.1.7. </span><span class=rvts6>Персональные данные </span><span class=rvts7>- любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (в т.ч. Пользователю) - субъекту персональных данных, согласно действующему законодательству Республики Беларусь, Соглашению, а также настоящей Политики конфиденциальности;</span>
    </p>

    <p class=rvps18><span class=rvts9>1.1.8. </span><span class=rvts6>Обработка персональных данных</span><span
            class=rvts7> - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;</span>
    </p>

    <p class=rvps12><span class=rvts9>1.1.9. </span><span class=rvts6>Конфиденциальность персональных данных</span><span
            class=rvts7> - обязательное для соблюдения сотрудниками Администрации, иными уполномоченными Администрацией лицами, Пользователями, а также иными третьими лицами, получившими доступ к персональным данным, требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</span>
    </p>

    <h3>2. Общие положения.</h3>

    <p class=rvps3><span class=rvts7>2.1.</span><span class=rvts7> &nbsp; &nbsp; &nbsp; &nbsp;</span><span class=rvts7>Использование Пользователем Приложения и/или Сайта означает безусловное согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</span>
    </p>

    <p class=rvps20><span class=rvts7>2.2.</span><span class=rvts7> &nbsp; &nbsp; &nbsp; &nbsp;</span><span class=rvts7>В случае несогласия с условиями Политики конфиденциальности Пользователь должен немедленно прекратить использование Приложения и/или Сайта.</span>
    </p>

    <p class=rvps20><span class=rvts7>2.3.</span><span class=rvts7> &nbsp; &nbsp; &nbsp; &nbsp;</span><span class=rvts7>Настоящая Политика конфиденциальности применяется только к Приложению и Сайту. Администрация не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным в Приложении и на Сайте. </span>
    </p>

    <p class=rvps20><span class=rvts7>2.4.</span><span class=rvts7> &nbsp; &nbsp; &nbsp; &nbsp;</span><span class=rvts7>Администрация не обязана проверять достоверность персональных данных, предоставляемых Пользователем. Ответственность за предоставление достоверных и не нарушающих требования действующего законодательства Республики Беларусь данных лежит непосредственно на Пользователе.</span>
    </p>

    <p class=rvps17><span class=rvts20><br></span></p>

    <h3>3. Предмет Политики конфиденциальности.</h3>

    <p class=rvps20><span class=rvts7>3.1.</span><span class=rvts7> &nbsp; &nbsp; &nbsp; &nbsp;</span><span class=rvts7>Настоящая Политика конфиденциальности устанавливает обязательства Администрации Приложения и Сайта по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации при прохождении процедуры регистрации и авторизации в Приложении и на Сайте, а также осуществляя использование Приложения и/или Сайта в личных, профессиональных и иных целях.</span>
    </p>

    <p class=rvps20><span class=rvts7>3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности - данные предоставляемые Пользователем путём заполнения регистрационной формы в разделе Приложения «Регистрация» и/или на странице Сайта pharmbonus.by.</span>
    </p>

    <p class=rvps20><span class=rvts7>3.3. Приложение и Сайт могут осуществляют сбор статистики об IP-адресах своих Пользователей. </span>
    </p>

    <p class=rvps3><span class=rvts7>3.4. Любая иная персональная информация неоговоренная выше подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.</span>
    </p>

    <h3>4. Цели сбора персональной информации Пользователя. </h3>

    <p class=rvps3><span
            class=rvts7>4.1. Персональные данные Пользователя Администрация может использовать в целях:</span></p>

    <p class=rvps20><span class=rvts7>4.1.1. Идентификации Пользователя, зарегистрированного в Приложении и/или на Сайте;</span>
    </p>

    <p class=rvps20><span class=rvts7>4.1.2. Предоставления Пользователю доступа к Информационной базе, функциональным возможностям Приложения и/или Сайта, а также предоставляемым на их основе сервисам;</span>
    </p>

    <p class=rvps20><span class=rvts7>4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, обработки запросов, а также осуществления иной активности, связанной с использованием Приложения и Сайта, а также предоставляемых на их основе сервисов;</span>
    </p>

    <p class=rvps20><span class=rvts7>4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества;</span>
    </p>

    <p class=rvps20><span class=rvts7>4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем;</span>
    </p>

    <p class=rvps20><span class=rvts7>4.1.6. Создания соответствующей учетной записи Пользователя;</span></p>

    <p class=rvps20><span class=rvts7>4.1.7. Предоставления Пользователю эффективной технической поддержки при возникновении проблем, связанных с использованием Приложения и/или Сайта;</span>
    </p>

    <p class=rvps20><span class=rvts7>4.1.8. Предоставления Пользователю обновлений, специальных предложений, новостной рассылки и иных сведений от имени Администрации;</span>
    </p>

    <p class=rvps20><span class=rvts7>4.1.9. Предоставления доступа Пользователю на сайты или сервисы партнеров и участия Пользователя в соответствующих программах лояльности, бонусных программах, анкетировании, конкурсах, и иной подобной активности.&nbsp; </span>
    </p>

    <h3>5. Способы и сроки обработки персональной информации.</h3>

    <p class=rvps3><span class=rvts7>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств. </span>
    </p>

    <p class=rvps20><span class=rvts7>5.2. Пользователь соглашается с тем, что Администрация вправе передавать персональные данные третьим лицам. </span>
    </p>

    <p class=rvps20><span class=rvts7>5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Республики Беларусь только по основаниям и в порядке, установленным действующим законодательством Республики Беларусь, а также при наличии соответствующего законного требования.</span>
    </p>

    <p class=rvps20><span class=rvts7>5.4. При утрате или разглашении персональных данных Администрация информирует Пользователя об утрате или разглашении персональных данных.</span>
    </p>

    <p class=rvps20><span class=rvts7>5.5. Администрация принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</span>
    </p>

    <p class=rvps3><span class=rvts7>5.6. Администрация совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</span>
    </p>

    <h3>6. Обязательства сторон.</h3>

    <p class=rvps3><span class=rvts6>6.1. Пользователь обязан:</span></p>

    <p class=rvps20><span class=rvts7>6.1.1. Предоставить информацию о персональных данных, необходимую для использования Приложения и/или Сайта;</span>
    </p>

    <p class=rvps20><span class=rvts7>6.1.2. Обновлять и дополнять предоставленную информацию о персональных данных в случае изменения данной информации (поддерживать в актуальном состоянии).</span>
    </p>

    <p class=rvps20><span class=rvts6>6.2. Администрация обязана:</span></p>

    <p class=rvps20><span class=rvts7>6.2.1. Использовать полученную информацию исключительно для целей, указанных в настоящей Политики конфиденциальности и Соглашении;</span>
    </p>

    <p class=rvps20><span class=rvts7>6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности;</span>
    </p>

    <p class=rvps20><span class=rvts7>6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого для защиты такого рода информации в электронной среде;</span>
    </p>

    <p class=rvps20><span class=rvts7>6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя, или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.</span>
    </p>

    <h3>7. Ответственность сторон.</h3>

    <p class=rvps20><span class=rvts7>7.1. Администрация, не исполнившая свои обязательства, несёт ответственность за убытки, понесенные Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Республики Беларусь, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.</span>
    </p>

    <p class=rvps20><span class=rvts7>7.2. В случае утраты или разглашения Конфиденциальной информации Администрация не несёт ответственность, если данная конфиденциальная информация:</span>
    </p>

    <p class=rvps20><span class=rvts7>7.2.1. Стала публичным достоянием до её утраты или разглашения;</span></p>

    <p class=rvps20><span
            class=rvts7>7.2.2. Была получена от третьей стороны до момента её получения Администрацией;</span></p>

    <p class=rvps20><span class=rvts7>7.2.3. Была разглашена с согласия Пользователя.</span></p>

    <h3>8. Разрешение споров.</h3>

    <p class=rvps20><span class=rvts7>8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией относительно Персональной информации и настоящей Политики конфиденциальности, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора). </span>
    </p>

    <p class=rvps20><span class=rvts7>8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии. </span>
    </p>

    <p class=rvps20><span class=rvts7>8.4. В случае недостижения согласия между сторонами в претензионном (внесудебном) порядке и обращении одной из Сторон в судебные органы, к настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией применяется действующее законодательство Республики Беларусь, а судебные споры подлежат рассмотрению в соответствующих судебных органах Республики Беларусь.</span>
    </p>

    <h3>9. Дополнительные условия.</h3>

    <p class=rvps20><span class=rvts7>9.1. Администрация вправе в любое время вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</span>
    </p>

    <p class=rvps20><span class=rvts7>9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения в разделе «Профиль» Приложения и (или) на странице Сайта http://pharmbonus.by/terms, если иное не предусмотрено действующим законодательством Республики Беларусь, новой редакцией Политики конфиденциальности, либо действующей редакцией Соглашения.</span>
    </p>

    <p class=rvps20><span class=rvts7>9.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать через Профиль и/или (Личный кабинет) Пользователя в Приложении и/или на Сайте, либо на адрес электронной почты (support@pharmbonus.by).</span>
    </p>

    <p class=rvps20><a name="_30j0zll"></a>
        <span class=rvts7>9.4. Действующая Политика конфиденциальности размещена на странице Сайта http://pharmbonus.by/terms и в Приложения&nbsp; в разделе Профиль и/или (Личный кабинет).</span>
    </p>

    <p class=rvps20><span class=rvts7>9.5. Действующая Политика конфиденциальности является неотъемлемой частью действующей редакции Соглашения. </span>
    </p>

    <p class=rvps26><span class=rvts7>Обновлено «08» февраля 2017 года.</span></p>

    <p class=rvps11><span class=rvts20><br></span></p>
</div>

