admin/controllers/factories/ProductController.php

SELECT * FROM `factories`
---
    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'factories'=> ArrayHelper::map(Factory::find()->asArray()->all(),'id','title'),