admin/controllers/factories/StockController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'factories'=> ArrayHelper::map(Factory::find()->asArray()->all(),'id','title'),
            'firms' => ArrayHelper::map(Firm::find()->asArray()->all(),'id','name'),
            'education' => ArrayHelper::map(Education::find()->asArray()->all(),'id','name'),
---
SELECT * FROM `factories`
SELECT * FROM `firms`
SELECT * FROM `user_education`