admin/controllers/stocks/AnswerController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'logins' => ArrayHelper::map(User::find()->asArray()->all(),'id','login'),
            'stocks' => ArrayHelper::map(Stock::find()->asArray()->all(),'title','title'),
---
SELECT * FROM `users`
SELECT * FROM `stocks`