admin/controllers/surveys/AnswerController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'logins' => ArrayHelper::map(User::find()->asArray()->all(), 'id','login'),
            'surveys' => ArrayHelper::map(Survey::find()->asArray()->all(), 'title','title'),
---
SELECT * FROM `users`
SELECT * FROM `surveys`