common/models/Banner.php

    public function getLinkTitle()
    {
        $path = explode('/',$this->link);
        $name = '';
        $item = ['title'=>''];
        switch($path[0]) {
            case 'present':
                $item = Item::findOne($path[1]);
                $name = 'Подарок: ';
                break;
            case 'survey':
                $item = Survey::findOne($path[1]);
                $name = 'Анкета: ';
                break;
            case 'seminar':
                $item = Seminar::findOne($path[1]);
---
SELECT * FROM `shop_items` WHERE `id`='34'
SELECT * FROM `surveys` WHERE `id`='1'
SELECT * FROM `seminars` WHERE `id`='41'

    public function getCompanyView($isFull = false)
    {
        $result = ArrayHelper::getColumn((Company::find()->select([
            Company::tableName().'.title'])
            ->from(Company::tableName())
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Company::tableName().'.id = '.Pharmacy::tableName().'.company_id')
            ->join('LEFT JOIN', Banner_Pharmacy::tableName(),
                Banner_Pharmacy::tableName().'.pharmacy_id = '.Pharmacy::tableName().'.id')
            ->distinct()
            ->asArray()
            ->where(['banner_id' => $this->id])
            ->all()),'title');
---
SELECT DISTINCT `companies`.`title` FROM `companies` LEFT JOIN `company_pharmacies` ON companies.id = company_pharmacies.company_id LEFT JOIN `banner_for_pharmacies` ON banner_for_pharmacies.pharmacy_id = company_pharmacies.id WHERE `banner_id`=49