common/models/Company.php

SELECT COUNT(*) FROM `pharmacists` LEFT JOIN `company_pharmacies` ON `pharmacists`.`pharmacy_id` = `company_pharmacies`.`id` WHERE `company_pharmacies`.`company_id`=1
---
    public function getUserCount()
    {
        return Pharmacist::find()->joinWith('pharmacy')
            ->andWhere([Pharmacy::tableName().'.company_id' => $this->id])
            ->count();