common/models/Item.php

SELECT DISTINCT `companies`.`title` FROM `companies` LEFT JOIN `company_pharmacies` ON companies.id = company_pharmacies.company_id LEFT JOIN `shop_item_for_pharmacies` ON shop_item_for_pharmacies.pharmacy_id = company_pharmacies.id WHERE `item_id`=29
---
    public function getCompanyView($isFull = false)
    {
        $result = ArrayHelper::getColumn((Company::find()->select([
            Company::tableName().'.title'])
            ->from(Company::tableName())
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Company::tableName().'.id = '.Pharmacy::tableName().'.company_id')
            ->join('LEFT JOIN', Item_Pharmacy::tableName(),
                Item_Pharmacy::tableName().'.pharmacy_id = '.Pharmacy::tableName().'.id')
            ->distinct()
            ->asArray()
            ->where(['item_id' => $this->id])
            ->all()),'title');