common/models/News.php

SELECT COUNT(*) FROM (SELECT DISTINCT `user_id` FROM `news_views` WHERE `news_id`=24) `c`
---
    public function countUniqueViews()
    {
        $this->views = View::find()->select('user_id')->
            distinct()->where(['news_id' => $this->id])->count() + $this->views_added;

SELECT DISTINCT `companies`.`title` FROM `companies` LEFT JOIN `company_pharmacies` ON companies.id = company_pharmacies.company_id LEFT JOIN `news_for_pharmacies` ON news_for_pharmacies.pharmacy_id = company_pharmacies.id WHERE `news_id`=24
---
    public function getCompanyView($isFull = false)
    {
        $result = ArrayHelper::getColumn((Company::find()->select([
            Company::tableName() . '.title'])
            ->from(Company::tableName())
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Company::tableName() . '.id = ' . Pharmacy::tableName() . '.company_id')
            ->join('LEFT JOIN', News_Pharmacy::tableName(),
                News_Pharmacy::tableName() . '.pharmacy_id = ' . Pharmacy::tableName() . '.id')
            ->distinct()
            ->asArray()
            ->where(['news_id' => $this->id])
            ->all()), 'title');