common/models/Presentation.php

SELECT DISTINCT `companies`.`title` FROM `companies` LEFT JOIN `company_pharmacies` ON companies.id = company_pharmacies.company_id LEFT JOIN `presentation_for_pharmacies` ON presentation_for_pharmacies.pharmacy_id = company_pharmacies.id WHERE `presentation_id`=34
---
    public function getCompanyView($isFull = false)
    {
        $result = ArrayHelper::getColumn((Company::find()->select([
            Company::tableName().'.title'])
            ->from(Company::tableName())
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Company::tableName().'.id = '.Pharmacy::tableName().'.company_id')
            ->join('LEFT JOIN', Presentation_Pharmacy::tableName(),
                Presentation_Pharmacy::tableName().'.pharmacy_id = '.Pharmacy::tableName().'.id')
            ->distinct()
            ->asArray()
            ->where(['presentation_id' => $this->id])
            ->all()),'title');