common/models/Survey.php

    public function getCompanyView($isFull = false)
    {
        $result = ArrayHelper::getColumn((Company::find()->select([
            Company::tableName().'.title'])
            ->from(Company::tableName())
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Company::tableName().'.id = '.Pharmacy::tableName().'.company_id')
            ->join('LEFT JOIN', Survey_Pharmacy::tableName(),
                Survey_Pharmacy::tableName().'.pharmacy_id = '.Pharmacy::tableName().'.id')
            ->distinct()
            ->asArray()
            ->where(['survey_id' => $this->id])
            ->all()),'title');
---
SELECT DISTINCT `companies`.`title` FROM `companies` LEFT JOIN `company_pharmacies` ON companies.id = company_pharmacies.company_id LEFT JOIN `survey_for_pharmacies` ON survey_for_pharmacies.pharmacy_id = company_pharmacies.id WHERE `survey_id`=34