common/models/Theme.php

SELECT * FROM `forms`
---
    public static function getTypesList()
    {
        $free = [0 => 'Свободная тема'];
        $array = array_merge($free, ArrayHelper::map(Form::find()->all(), 'id', 'title'));