common/models/User.php

    public function saveImage()
    {
        if($this->image) {
            $this->deleteCurrentAvatar();
            $filename = Yii::$app->getSecurity()->generateRandomString() . time() . '.' . $this->image->extension;
            $newAvatarPath = Yii::getAlias('@uploads/avatars/'.$filename);
            $this->image->saveAs($newAvatarPath);
---
UPDATE `users` SET `status`=0 WHERE `id`=199