admin/models/admin/Right.php

    public static function HasAdmin($id, $url) {
        $rule = HasRight::find()->joinWith('right')->where(['admin_id'=>$id,'action'=>$url])->one();
---
SELECT `administrator_has_rights`.* FROM `administrator_has_rights` LEFT JOIN `administrator_rights` ON `administrator_has_rights`.`right_id` = `administrator_rights`.`id` WHERE (`admin_id`=1) AND (`action`='main')