
<p>Спасибо что зарегистрировались в мобильном приложении ФармБонус!</p>

<p>Ваш логин: <?= $user->login ?></p>
<p>Ваш пароль: <?= $password ?></p>

<p>Нам требуется 48 часов, чтобы проверить данные, которые Вы указали при регистрации, после чего Вам будет предоставлен доступ ко всем разделам приложения.</p>

<p>Спасибо за понимание, администрация ФармБонус</p>

<p>По всем вопросам, связанным с работой мобильного приложения, обращайтесь в тех.поддержку:
    e-mail: support@pharmbonus.by
    моб.тел: +375 29 1953706 (velcom)</p>
