common/models/company/Pharmacy.php

SELECT COUNT(*) FROM `pharmacists` LEFT JOIN `company_pharmacies` ON `pharmacists`.`pharmacy_id` = `company_pharmacies`.`id` WHERE `pharmacists`.`pharmacy_id`=1
---
    public function getUserCount()
    {
        return Pharmacist::find()->joinWith('pharmacy')
            ->andWhere([Pharmacist::tableName().'.pharmacy_id' => $this->id])
            ->count();