common/models/factory/Stock.php

    public function getFirmsView($isFull = false) {
        $result = ArrayHelper::getColumn((Firm::find()->select([
            'firms.name'])
            ->from(Firm::tableName())
            ->join('LEFT JOIN', P::tableName(),
                Firm::tableName().'.id = '.P::tableName().'.firm_id')
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Pharmacy::tableName().'.pharmacy_id = '.P::tableName().'.id')
            ->distinct()
            ->asArray()
            ->where(['stock_id' => $this->id])
            ->all()),'name');
---
SELECT DISTINCT `firms`.`name` FROM `firms` LEFT JOIN `firm_pharmacies` ON firms.id = firm_pharmacies.firm_id LEFT JOIN `factory_stock_for_pharmacies` ON factory_stock_for_pharmacies.pharmacy_id = firm_pharmacies.id WHERE `stock_id`=6