common/models/location/City.php

    public function getUserCount()
    {
        return Pharmacist::find()->joinWith('pharmacy')
            ->join('LEFT JOIN', City::tableName(),
                Pharmacy::tableName().'.city_id = '.City::tableName().'.id')
            ->andWhere([static::tableName().'.id' => $this->id])
            ->count();
---
SELECT COUNT(*) FROM `pharmacists` LEFT JOIN `company_pharmacies` ON `pharmacists`.`pharmacy_id` = `company_pharmacies`.`id` LEFT JOIN `region_cities` ON company_pharmacies.city_id = region_cities.id WHERE `region_cities`.`id`=63