common/models/location/Region.php

    public function getCitiesCount()
    {
        $cityCount = Pharmacist::find()
            ->from([Pharmacist::tableName(), Pharmacy::tableName(), City::tableName(), Region::tableName()])
            ->select('count('.Pharmacist::tableName().'.id'.') as count,'. Pharmacy::tableName().'.city_id')
            ->where(Pharmacist::tableName().'.pharmacy_id = '.Pharmacy::tableName().'.id')
            ->andWhere(Pharmacy::tableName().'.city_id ='.City::tableName().'.id')
            ->andWhere(City::tableName().'.region_id ='.Region::tableName().'.id')
            ->andWhere([Region::tableName().'.id'=>$this->id])
            ->groupBy(Pharmacy::tableName().'.city_id');
        return $this->hasMany(City::className(), ['region_id' => 'id'])
            ->leftJoin(['cityCount' => $cityCount], 'cityCount.city_id = id')
            ->orderBy(['cityCount.count' => SORT_DESC]);
---
SELECT COUNT(*) FROM `pharmacists` LEFT JOIN `company_pharmacies` ON `pharmacists`.`pharmacy_id` = `company_pharmacies`.`id` LEFT JOIN `region_cities` ON company_pharmacies.city_id = region_cities.id LEFT JOIN `regions` ON regions.id = region_cities.region_id WHERE `regions`.`id`=1