admin/controllers/themes/AnswerController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'logins'=> ArrayHelper::map(User::find()->asArray()->all(),'login','login'),
            'names'=> ArrayHelper::map(User::find()->asArray()->all(),'name','name'),
            'themes'=> ArrayHelper::map(Theme::find()->asArray()->all(),'title','title'),
---
SELECT * FROM `users`
SELECT * FROM `themes`