admin/views/layouts/admin.php

SELECT COUNT(*) FROM `user_update_requests`
SELECT COUNT(*) FROM `agent_update_requests`
SELECT COUNT(*) FROM `pharmacist_update_requests`
---

AppAsset::register($this);

$count_agents = AgentUpdateRequest::find()->count();
$count_pharmacists = PharmacistUpdateRequest::find()->count();