admin/views/user/agents/index.php

                'label' => 'Фабрика',
                'attribute' => 'factory_id',
                'value'=>function($model) {
                    return Factory::find()->where(['id' => $model->factory_id])->exists() ?
---
SELECT * FROM `factories` WHERE `id`='2'
SELECT EXISTS(SELECT * FROM `factories` WHERE `id`='2')