admin/controllers/BannerController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'positions' => Banner::positions(),
            'pages' => Banner::pages(),
            'education' => ArrayHelper::map(Education::find()->asArray()->all(),'id','name'),
            'firms' => ArrayHelper::map(Firm::find()->asArray()->all(),'id','name'),
---
SELECT * FROM `firms`