admin/controllers/MainController.php

SELECT `id`, `date_reg` FROM `users` ORDER BY `date_reg` DESC
---
            ],
        ]);

        $date_reg_array = ArrayHelper::map(User::find()->select('id, date_reg')
            ->orderBy('date_reg DESC')
            ->asArray()
            ->all(), 'id', 'date_reg');

SELECT count(pharmacists.id) as count, month(date_reg) as month FROM `pharmacists` LEFT JOIN `users` ON `pharmacists`.`id` = `users`.`id` WHERE year(date_reg) > 2015 GROUP BY `month` ORDER BY `month`
---

        $years = array_unique($years);

        $count_in_month = Pharmacist::find()->select('count('.Pharmacist::tableName().'.id'.') as count,
        month(date_reg) as month, year(date_reg) as year')
            ->joinWith('user')
            ->where('year(date_reg) > 2015')
            ->groupBy(['month', 'year'])
            ->orderBy('month')
            ->asArray()
            ->all();

SELECT `users`.`name` AS `name`, `regions`.`name` AS `region`, month(date_reg) as month, `date_reg` FROM `pharmacists` LEFT JOIN `users` ON `pharmacists`.`id` = `users`.`id` LEFT JOIN `company_pharmacies` ON company_pharmacies.id = pharmacists.pharmacy_id LEFT JOIN `region_cities` ON company_pharmacies.city_id = region_cities.id LEFT JOIN `regions` ON regions.id = region_cities.region_id WHERE year(date_reg) > 2015
SELECT count(pharmacists.id) as count, `regions`.`name`, month(date_reg) as month FROM `pharmacists` LEFT JOIN `users` ON `pharmacists`.`id` = `users`.`id` LEFT JOIN `company_pharmacies` ON company_pharmacies.id = pharmacists.pharmacy_id LEFT JOIN `region_cities` ON company_pharmacies.city_id = region_cities.id LEFT JOIN `regions` ON regions.id = region_cities.region_id WHERE year(date_reg) > 2015 GROUP BY `regions`.`id`, `month`
---
            }
        }

        $region_month = Pharmacist::find()
            ->select('count('.Pharmacist::tableName().'.id'.') as count, '.Region::tableName().'.name,
            month(date_reg) as month, year(date_reg) as year')
            ->joinWith('user')
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Pharmacy::tableName().'.id = '.Pharmacist::tableName().'.pharmacy_id')
            ->join('LEFT JOIN', City::tableName(),
                Pharmacy::tableName().'.city_id = '.City::tableName().'.id')
            ->join('LEFT JOIN', Region::tableName(),
                Region::tableName().'.id = '.City::tableName().'.region_id')
            ->where('year(date_reg) > 2015')
            ->groupBy([Region::tableName().'.id', 'month', 'year'])
            ->asArray()
            ->all();

        $user_region_month = Pharmacist::find()
            ->select(User::tableName().'.name as name,'.Region::tableName().'.name as region, month(date_reg) as month,
            year(date_reg) as year, date_reg')
            ->joinWith('user')
            ->join('LEFT JOIN', Pharmacy::tableName(),
                Pharmacy::tableName().'.id = '.Pharmacist::tableName().'.pharmacy_id')
            ->join('LEFT JOIN', City::tableName(),
                Pharmacy::tableName().'.city_id = '.City::tableName().'.id')
            ->join('LEFT JOIN', Region::tableName(),
                Region::tableName().'.id = '.City::tableName().'.region_id')
            ->where('year(date_reg) > 2015')
            ->orderBy('date_reg DESC')
            ->asArray()
            ->all();