admin/controllers/MainController.php

SELECT COUNT(*) FROM `pharmacists` LEFT JOIN `users` ON `pharmacists`.`id` = `users`.`id` WHERE `status`=1
SELECT COUNT(*) FROM `agents` LEFT JOIN `users` ON `agents`.`id` = `users`.`id` WHERE `status`=1
---
            ],
        ]);

        $pharmacists = Pharmacist::find()->joinWith('user')->where(['status' => 1])->count();
        $agents = Agent::find()->joinWith('user')->where(['status' => 1])->count();