admin/controllers/NewsController.php

    public function actionCreate()
    {
        $model = new News();
        $model->scenario = 'create';
        $news_cities = new News_City();
        $news_pharmacies = new News_Pharmacy();
        $news_education = new News_Education();

        if ($model->load(Yii::$app->request->post())) {
            $model->imageFile = UploadedFile::getInstance($model, 'imageFile');
            $model->thumbFile = UploadedFile::getInstance($model, 'thumbFile');
            if ($model->save()) {
                $model->loadCities(Yii::$app->request->post('cities'));
                $model->loadPharmacies(Yii::$app->request->post('pharmacies'));
                $model->loadEducation(Yii::$app->request->post('education'));
                return $this->redirect(['view', 'id' => $model->id]);
            }
        } else {
            return $this->render('create', [
                'model' => $model,
                'cities'=>City::find()->asArray()->all(),
                'pharmacies'=>Pharmacy::find()->asArray()->all(),
                'education' => Education::find()->asArray()->all(),
                'news_cities' => $news_cities,
                'news_pharmacies' => $news_pharmacies,
                'news_education' => $news_education
            ]);
---
SELECT * FROM `user_education`