admin/controllers/PresentController.php

SELECT * FROM `shop_vendors`
SELECT * FROM `companies`
SELECT * FROM `shop_items`
---
    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'vendors'=>ArrayHelper::map(Vendor::find()->asArray()->all(), 'id','name'),
            'pharmacies'=>ArrayHelper::map(Pharmacy::find()->asArray()->all(),'id','name'),
            'companies' => ArrayHelper::map(Company::find()->asArray()->all(),'id','title'),
            'titles'=>ArrayHelper::map(Item::find()->asArray()->all(), 'title','title'),
        ]);

SELECT * FROM `regions`
SELECT * FROM `shop_vendors`
SELECT * FROM `companies`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $old_cities = Pharmacy::find()->select('city_id')->joinWith('itemPharmacies')
            ->where(['item_id' => $id])->asArray()->all();
        $old_companies = Pharmacy::find()->select('company_id')->joinWith('itemPharmacies')
            ->where(['item_id' => $id])->asArray()->all();

        if ($model->load(Yii::$app->request->post())) {
            $model->imageFile = UploadedFile::getInstance($model, 'imageFile');
            $model->thumbFile = UploadedFile::getInstance($model, 'thumbFile');
            if ($model->save()) {
                if(Yii::$app->request->post('pharmacies')) {
                    $model->updatePharmacies(Yii::$app->request->post('pharmacies'));
                }
                return $this->redirect(['view', 'id' => $model->id]);
            }
        } else {
            return $this->render('update', [
                'model' => $model,
                'vendors'=>ArrayHelper::map(Vendor::find()->asArray()->all(), 'id','name'),
                'regions'=>Region::find()->asArray()->all(),
                'cities'=>City::find()->all(),
                'companies'=>Company::find()->asArray()->all(),
                'old_cities' => $old_cities,
                'old_companies' => $old_companies,
            ]);

SELECT * FROM `shop_items` WHERE `id`='37'
---
    protected function findModel($id)
    {
        if (($model = Item::findOne($id)) !== null) {