admin/controllers/PresentationController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'education' => ArrayHelper::map(Education::find()->asArray()->all(),'id','name'),
            'pharmacies'=>ArrayHelper::map(Pharmacy::find()->asArray()->all(),'id','name'),
            'types' => ArrayHelper::map(Type::find()->asArray()->all(),'id','name'),
            'companies' => ArrayHelper::map(Company::find()->asArray()->all(),'id','title'),
            'titles'=>ArrayHelper::map(Presentation::find()->asArray()->all(), 'title','title'),
        ]);
---
SELECT * FROM `user_education`
SELECT * FROM `user_types`
SELECT * FROM `companies`
SELECT * FROM `presentations`

    protected function findModel($id)
    {
        if (($model = Presentation::findOne($id)) !== null) {
---
SELECT * FROM `presentations` WHERE `id`='33'