admin/controllers/SurveyController.php

SELECT * FROM `user_education`
SELECT * FROM `user_types`
SELECT * FROM `companies`
SELECT * FROM `surveys`
---
    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'education' => ArrayHelper::map(Education::find()->asArray()->all(),'id','name'),
            'pharmacies'=>ArrayHelper::map(Pharmacy::find()->asArray()->all(),'id','name'),
            'types' => ArrayHelper::map(Type::find()->asArray()->all(),'id','name'),
            'companies' => ArrayHelper::map(Company::find()->asArray()->all(),'id','title'),
            'titles'=>ArrayHelper::map(Survey::find()->asArray()->all(), 'title','title'),
        ]);

SELECT * FROM `user_education`
SELECT * FROM `regions`
SELECT * FROM `user_types`
SELECT * FROM `companies`
---

        }

        return $this->render('create', [
            'model' => $model,
            'questions' => (empty($questions)) ? [new Question] : $questions,
            'options' => (empty($options)) ? [new Option] : $options,
            'education' => Education::find()->asArray()->all(),
            'regions'=>Region::find()->asArray()->all(),
            'types'=>Type::find()->asArray()->all(),
            'cities'=>City::find()->all(),
            'companies'=>Company::find()->asArray()->all(),
            'factories'=>ArrayHelper::map(Factory::find()->asArray()->all(), 'id','title'),
        ]);

SELECT * FROM `user_education`
SELECT * FROM `regions`
SELECT * FROM `factories`
SELECT * FROM `user_types`
---
            }
        }

        return $this->render('update', [
            'model' => $model,
            'questions' => (empty($questions)) ? [new Question] : $questions,
            'options' => (empty($options)) ? [new Option] : $options,
            'education' => Education::find()->asArray()->all(),
            'regions'=>Region::find()->asArray()->all(),
            'types'=>Type::find()->asArray()->all(),
            'cities'=>City::find()->all(),
            'companies'=>Company::find()->asArray()->all(),
            'factories'=>ArrayHelper::map(Factory::find()->asArray()->all(), 'id','title'),
            'old_types' => $old_types,
            'old_cities' => $old_cities,
            'old_companies' => $old_companies,
            'old_education' => $old_education
        ]);

SELECT * FROM `surveys` WHERE `id`='31'
---
    protected function findModel($id)
    {
        if (($model = Survey::findOne($id)) !== null) {