admin/controllers/ThemeController.php

SELECT * FROM `themes`
SELECT * FROM `factories`
---
    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'emails'=>ArrayHelper::map(Theme::find()->asArray()->all(),'email','email'),
            'factories' => ArrayHelper::map(Factory::find()->asArray()->all(),'id','title'),
            'titles'=>ArrayHelper::map(Theme::find()->asArray()->all(), 'title','title'),

SELECT * FROM `factories`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            if(!$model->form_id)
                $model->form_id = 0;
            $model->save();
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            return $this->render('update', [
                'model' => $model,
                'factories'=> ArrayHelper::map(Factory::find()->asArray()->all(),'id','title'),

SELECT * FROM `themes` WHERE `id`='7'
---
    protected function findModel($id)
    {
        if (($model = Theme::findOne($id)) !== null) {