admin/controllers/ThemeController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'emails'=>ArrayHelper::map(Theme::find()->asArray()->all(),'email','email'),
            'companies' => ArrayHelper::map(Company::find()->asArray()->all(),'id','title'),
---
SELECT * FROM `companies`

    public function actionCreate()
    {
        $model = new Theme();

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            $model->save();
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            return $this->render('create', [
                'model' => $model,
                'companies'=> ArrayHelper::map(Company::find()->asArray()->all(),'id','title'),
---
SELECT * FROM `companies`