admin/controllers/UserController.php

SELECT * FROM `users` WHERE `type_id`=2
SELECT * FROM `factories`
---
    public function actionAgents()
    {
        $searchModel = new Agent_Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);


        return $this->render('agents/index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'names' => ArrayHelper::map(User::find()->where(['type_id' => 2])->asArray()->all(), 'name', 'name'),
            'factories' => ArrayHelper::map(Factory::find()->asArray()->all(), 'id', 'title'),
            'emails' => ArrayHelper::map(User::find()->where(['type_id' => 2])->asArray()->all(), 'email', 'email'),
        ]);

SELECT * FROM `users` WHERE `type_id`=1
SELECT * FROM `companies`
---
    public function actionPharmacists()
    {
        $searchModel = new Pharmacist_Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        return $this->render('pharmacists/index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'names' => ArrayHelper::map(User::find()->where(['type_id' => 1])->asArray()->all(), 'name', 'name'),
            'pharmacies' => ArrayHelper::map(Pharmacy::find()->asArray()->all(), 'id', 'name'),
            'cities' => ArrayHelper::map(City::find()->asArray()->all(), 'id', 'name'),
            'companies' => ArrayHelper::map(Company::find()->asArray()->all(), 'id', 'title'),
            'emails' => ArrayHelper::map(User::find()->where(['type_id' => 1])->asArray()->all(), 'email', 'email'),
        ]);

SELECT * FROM `pharmacists` WHERE `id`='200'
---
    public function actionUpdate($id, $update_id = null)
    {
        $model = $this->findModel($id);
        $model->scenario = 'update';
        switch($model->type_id) {
            case Type::TYPE_PHARMACIST: $type = Pharmacist::findOne($id);

SELECT * FROM `companies`
SELECT * FROM `regions`
---
                case Type::TYPE_PHARMACIST:
                    return $this->render('pharmacists/update', [
                        'model' => $model,
                        'companies' => ArrayHelper::map(Company::find()->asArray()->all(), 'id','title'),
                        'regions' => ArrayHelper::map(Region::find()->asArray()->all(), 'id','name'),

SELECT * FROM `user_education`
SELECT * FROM `user_positions`
---
                        'pharmacies' => ArrayHelper::map(Pharmacy::find()
                            ->select(['id', new \yii\db\Expression("CONCAT(`name`, ' (', `address`,')') as name")])
                            ->asArray()->all(), 'id','name'),
                        'education' => ArrayHelper::map(Education::find()->asArray()->all(), 'id','name'),
                        'positions' => ArrayHelper::map(Position::find()->asArray()->all(), 'id','name'),

SELECT * FROM `users` WHERE `id`='200'
---
    protected function findModel($id)
    {
        if (($model = User::findOne($id)) !== null) {