admin/controllers/VideoController.php

SELECT * FROM `videos` WHERE `id`='6'
---
    protected function findModel($id)
    {
        if (($model = Video::findOne($id)) !== null) {