admin/views/theme/_form.php

        'options' => ['rows' => 6],
        'preset' => 'click'
    ]); ?>
    <?= $form->field($model, 'form_id')->widget(Select2::classname(), [
        'data' => ArrayHelper::map(Form::find()->all(), 'id', 'title'),
        'options' => ['placeholder' => 'Выберите форму (необязательно) ...'],
        'pluginOptions' => [
            'allowClear' => true
        ],
    ]); ?>
---
SELECT * FROM `forms`