admin/controllers/users/CompanyAdminController.php

    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);


        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'names' => ArrayHelper::map(Admin::find()->asArray()->all(), 'name', 'name'),
            'companies'=> ArrayHelper::map(Company::find()->asArray()->all(),'id','title'),
---
SELECT * FROM `companies`

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            if($model->save(false))
                return $this->redirect(['view', 'id' => $model->id]);
        } else {
            return $this->render('update', [
                'model' => $model,
                'companies'=> ArrayHelper::map(Company::find()->asArray()->all(),'id','title'),
---
SELECT * FROM `companies`