admin/controllers/users/FactoryAdminController.php

SELECT * FROM `factories`
---
    public function actionIndex()
    {
        $searchModel = new Search();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);


        return $this->render('index', [
            'searchModel' => $searchModel,
            'dataProvider' => $dataProvider,
            'names' => ArrayHelper::map(Admin::find()->asArray()->all(), 'name', 'name'),
            'factories' => ArrayHelper::map(Factory::find()->asArray()->all(), 'id', 'title'),

SELECT * FROM `factories`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post())) {
            if($model->save(false))
                return $this->redirect(['view', 'id' => $model->id]);
        } else {
            return $this->render('update', [
                'model' => $model,
                'factories'=> ArrayHelper::map(Factory::find()->asArray()->all(),'id','title'),