admin/controllers/users/PushUsersController.php

            return $this->redirect(['index']);

        } else {
            return $this->render('index', [
                'model' => $model,
                'users' => ArrayHelper::map(User::find()
                    ->select(['id', new \yii\db\Expression("CONCAT(`name`, ' (', `login`,')') as login")])
                    ->asArray()
                    ->all(), 'id','login'),
            ]);
---
SELECT `id`, CONCAT(`name`, ' (', `login`,')') as login FROM `users`