admin/controllers/users/PushGroupsController.php

                );
            }

            $android_tokens = ArrayHelper::map(Device::find()->select('id, push_token')->where(['in', 'user_id', $users])
                ->andWhere(['not',['push_token' => null]])
                ->andWhere(['type' => 1])
                ->asArray()
                ->all(), 'id', 'push_token');
---
SELECT `id`, `push_token` FROM `user_devices` WHERE ((`user_id` IN ('13', '21', '29', '30', '33', '38', '39', '44', '121', '161', '151', '130', '137', '126', '120', '166')) AND (NOT (`push_token` IS NULL))) AND (`type`=2)

            return $this->redirect(['index']);

        } else {
            return $this->render('index', [
                'model' => $model,
                'regions' => Region::find()->asArray()->all(),
                'cities' => City::find()->asArray()->all(),
                'education' => Education::find()->asArray()->all(),
                'companies' => Company::find()->asArray()->all(),
                'pharmacies' => Pharmacy::find()->asArray()->all(),
                'factories' => Factory::find()->asArray()->all(),
            ]);
---
SELECT * FROM `regions`
SELECT * FROM `user_education`
SELECT * FROM `companies`
SELECT * FROM `factories`