admin/controllers/users/PushGroupsController.php

SELECT `id`, `push_token` FROM `user_devices` WHERE ((0=1) AND (NOT (`push_token` IS NULL))) AND (`type`=1)
---
                );
            }

            $android_tokens = ArrayHelper::map(Device::find()->select('id, push_token')->where(['in', 'user_id', $users])
                ->andWhere(['not',['push_token' => null]])
                ->andWhere(['type' => 1])
                ->asArray()
                ->all(), 'id', 'push_token');